Autodesk.Revit.DB.Architecture.NonContinuousRailStructure.IsValidNonContinuousRailProfile(Autodesk.Revit.DB.ElementId)
Checks whether the input id represents a profile which can be used as the profile of this non-continuous rail.
Remarks:
Autodesk.Revit.DB.ElementId.InvalidElementId is considered a valid NonContinuousRail profile (the default profile).
profileId:
The profile Id to be checked.
Returns:
True if the ElementId refers to a valid NonContinuousRail profile, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2019

Autodesk.Revit.DB.Architecture.NonContinuousRailStructure.RemoveNonContinuousRail(System.Int32)
Removes Non-Continuous Rail from the Rail Structure.
index:
Non-Continuous Rail index.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The index index is out of range.
Since:
2019

Autodesk.Revit.DB.Architecture.NonContinuousRailStructure.GetNonContinuousRail(System.Int32)
Gets the Non-Continuous Rail object of specified index from the Rail Structure.
index:
Non-Continuous Rail index.
Returns:
The requested object handle.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The index index is out of range.
Since:
2019

Autodesk.Revit.DB.Architecture.NonContinuousRailStructure.AddNonContinuousRail(System.String,System.Double,System.Double)
Creates and appends a new Non-Continuous Rail to the Rail Structure.
The new Non-Continuous Rail will have the given name, height and offset.
It will have default profile and material ElementIds.
name:
The name of the non-continuous rail.
height:
The height on which the non-continuous rail will be placed.
offset:
The offset of the non-continuous rail from a Autodesk::Revit::DB::Architecture::Railing center.
Returns:
Handle to the new Non-Continuous Rail.
Throws Autodesk.Revit.Exceptions.ArgumentException:
name is an empty string or contains only whitespace.
-or-
name cannot include prohibited characters.
-or-
The name is a duplicate of an existing non-continuous rail.
-or-
The height height is not valid for the non-continuous rail because
it is greater than the height of the RailingType to which it belongs.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for height must be no more than 30000 feet in absolute value.
-or-
The given value for offset must be no more than 30000 feet in absolute value.
Since:
2019

Autodesk.Revit.DB.Architecture.NonContinuousRailStructure.GetNonContinuousRailCount
Gets number of Non-Continuous Rails.
Returns:
Count of Non-Continuous Rails.
Since:
2019

Autodesk.Revit.DB.Architecture.NonContinuousRailStructure.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Architecture.NonContinuousRailStructure
A class that represents a collection of Non-Continuous Rails being a part of Railing Type.
Since:
2019